# MepIgnoreFlowAnalysis Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepIgnoreFlowAnalysis Property
ParameterTypeId Class See Also
---
"Ignore Flow Analysis"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepIgnoreFlowAnalysis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepIgnoreFlowAnalysis As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepIgnoreFlowAnalysis {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace